lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
                    if(index < BLE_CFG_CLT_MAX_NBR_CB)
                    {
                        aP2PClientContext[index].connHandle= handle;
                        numServ = (pr->Data_Length) / pr->Attribute_Data_Length;
                        /* the event data will be
                         * 2bytes start handle
                         * 2bytes end handle
                         * 2 or 16 bytes data
                         * we are intersted only if the UUID is 16 bit.
                         * So check if the data length is 6
                         * we are intersted only if the UUID is 128 bit.
                         * So check if the data length is 20
                         */

                                if (uuid_bit_format==1){idx = 16;}
                                else if (uuid_bit_format==0){idx = 4;}

                                if (pr->Attribute_Data_Length == 20 || pr->Attribute_Data_Length == 6)
                                {

                                for (i=0; i<numServ; i++)
                                {
                                    uuid = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx]);
                                    switch(uuid)
                                    {
                                    	case(CYCLING_SPEED_CADENCE_SERVICE_UUID ):
										{
											scannedDevicesPackage.scannedDevicesList[index].supportedDataType.cadence = true;
											scannedDevicesPackage.scannedDevicesList[index].supportedDataType.speed = true;
											uuid_format_char = 0;
#if(CFG_DEBUG_APP_TRACE != 0)
											APP_DBG_MSG("-- GATT : CYCLING_POWER_SERVICE_UUID FOUND - connection handle 0x%x \n", aP2PClientContext[index].connHandle);
#endif
											if(uuid_bit_format==1){
											SERVICES_HANDLE[index].P2PServiceHandle_CSC = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-16]);
											SERVICES_HANDLE[index].P2PServiceEndHandle_CSC = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-14]);
											}
											else if(uuid_bit_format==0){
											SERVICES_HANDLE[index].P2PServiceHandle_CSC = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-4]);
											SERVICES_HANDLE[index].P2PServiceEndHandle_CSC = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-2]);
											}
											aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
											aP2PClientContext[index].sensor_evt_type = P2P_NOTIFICATION_CSC_RECEIVED_EVT;
											break;
										}
										case(CYCLING_POWER_SERVICE_UUID):
										{
											uuid_format_char = 0;
											aP2PClientContext[index].sensor_evt_type = P2P_NOTIFICATION_CP_RECEIVED_EVT;
											scannedDevicesPackage.scannedDevicesList[index].supportedDataType.power = true;
											break;
										}
										case(BATTERY_SERVICE_UUID):
										{
											uuid_format_char = 0;
											scannedDevicesPackage.scannedDevicesList[index].supportedDataType.battery = true;
											break;
										}
                                    	case(SHIMANO_SERVICE_UUID ):
                                    											{
#if(CFG_DEBUG_APP_TRACE != 0)
                                    	APP_DBG_MSG("-- GATT : SENSOR_SERVICE_UUID FOUND - connection handle 0x%x \n", aP2PClientContext[index].connHandle);
                                    	uuid_format_char = 1;
#endif

                                        if(uuid_bit_format==1){
                                        	aP2PClientContext[index].P2PServiceHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-16]);
                                            aP2PClientContext[index].P2PServiceEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-14]);
                                        }
                                        else if(uuid_bit_format==0){
                                        	aP2PClientContext[index].P2PServiceHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-4]);
                                        	aP2PClientContext[index].P2PServiceEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-2]);
                                        }

                                        aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
                                        aP2PClientContext[index].sensor_evt_type = P2P_NOTIFICATION_SHIMANO_RECEIVED_EVT;

                                    		break;
                                    	}

//                                    	case() a ajouter avec pour avoir le gear
                                    	default:
                                    		break;
                                    }
                                    idx += 6;
                                }
								if (scannedDevicesPackage.scannedDevicesList[index].supportedDataType.cadence == true &&
										scannedDevicesPackage.scannedDevicesList[index].supportedDataType.speed == true &&
										scannedDevicesPackage.scannedDevicesList[index].supportedDataType.power == true)
								{
									TYPE_OF_SENSOR = TRAINER;
								}
								else if(scannedDevicesPackage.scannedDevicesList[index].supportedDataType.cadence == true &&
										scannedDevicesPackage.scannedDevicesList[index].supportedDataType.speed == true &&
										scannedDevicesPackage.scannedDevicesList[index].supportedDataType.power == false)
								{
									TYPE_OF_SENSOR = CSC_SENSOR;
								}
								else if(scannedDevicesPackage.scannedDevicesList[index].supportedDataType.cadence == false &&
										scannedDevicesPackage.scannedDevicesList[index].supportedDataType.speed == false &&
										scannedDevicesPackage.scannedDevicesList[index].supportedDataType.power == true)
								{
									TYPE_OF_SENSOR = POWER_SENSOR;
								}
								else{
									TYPE_OF_SENSOR = OTHER;
								}

								switch(TYPE_OF_SENSOR){
									case POWER_SENSOR:
									{
#if(CFG_DEBUG_APP_TRACE != 0)
										APP_DBG_MSG("-- GATT : CYCLING_POWER_SERVICE_UUID FOUND - connection handle 0x%x \n", aP2PClientContext[index].connHandle);
#endif
										#if (UUID_128BIT_FORMAT==1)
										aP2PClientContext[index].P2PServiceHandle = SERVICES_HANDLE[index].P2PServiceHandle_CSC;
										aP2PClientContext[index].P2PServiceEndHandle = SERVICES_HANDLE[index].P2PServiceEndHandle_CSC;
#else
										aP2PClientContext[index].P2PServiceHandle = SERVICES_HANDLE[index].P2PServiceHandle_CSC;
										aP2PClientContext[index].P2PServiceEndHandle = SERVICES_HANDLE[index].P2PServiceEndHandle_CSC;
#endif
										aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
										break;
									}
									case TRAINER:
									{
#if(CFG_DEBUG_APP_TRACE != 0)
										APP_DBG_MSG("-- GATT : CYCLING_POWER_SERVICE_UUID FOUND - connection handle 0x%x \n", aP2PClientContext[index].connHandle);
#endif
										#if (UUID_128BIT_FORMAT==1)
										aP2PClientContext[index].P2PServiceHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-16]);
										aP2PClientContext[index].P2PServiceEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-14]);
#else
										aP2PClientContext[index].P2PServiceHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-4]);
										aP2PClientContext[index].P2PServiceEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-2]);
#endif
										aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
										break;
									}
									case CSC_SENSOR:
									{
#if(CFG_DEBUG_APP_TRACE != 0)
										APP_DBG_MSG("-- GATT : SENSOR_SERVICE_UUID FOUND - connection handle 0x%x \n", aP2PClientContext[index].connHandle);
#endif
										#if (UUID_128BIT_FORMAT==1)
										aP2PClientContext[index].P2PServiceHandle = SERVICES_HANDLE[index].P2PServiceHandle_CSC;
										aP2PClientContext[index].P2PServiceEndHandle = SERVICES_HANDLE[index].P2PServiceEndHandle_CSC;
#else
										aP2PClientContext[index].P2PServiceHandle = SERVICES_HANDLE[index].P2PServiceHandle_CSC;
										aP2PClientContext[index].P2PServiceEndHandle = SERVICES_HANDLE[index].P2PServiceEndHandle_CSC;
#endif
										aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
										break;
									}
								}

